export default {
  state: {
    articles: [
      {
        id: 0,
        title: "Первая статья",
        articles:"Это тестовый текст статьи в котором мы ничего не разбираем...",
        text: "Это тестовый текст статьи в котором мы ничего не разбираем...",
        route: "/articles/1",
      },
      {
        id: 1,
        title: "Вторая статья",
        articles:
          "Это тестовый текст статьи в котором мы ничего не разбираем...",
        text: "Это тестовый текст статьи в котором мы ничего не разбираем...",
        route: "/articles/2",
      },
      {
        id: 2,
        title: "Третья статья",
        articles:
          "Это тестовый текст статьи в котором мы ничего не разбираем...",
        text: "Это тестовый текст статьи в котором мы ничего не разбираем...",
        route: "/articles/3",
      },
    ],
  },
  mutations: {},
  actions: {},
  getters: {},
};
